app/controllers/orders_controller.rb

  def create
    @products = current_user.carted_products.where(status: "carted")
    @order = Order.new({user_id: current_user.id})
    @products.each do |product|
      @order.subtotal = product.product.price * product.quantity.to_i
    end
    @order.tax = @order.subtotal * 0.09
    @order.total = @order.subtotal + @order.tax


    if @order.save

      @products.update_all(status: "purchased", order_id: @order.id)
---
SELECT "carted_products".* FROM "carted_products" WHERE "carted_products"."user_id" = $1 AND "carted_products"."status" = $2  [["user_id", 3], ["status", "carted"]]
INSERT INTO "orders" ("user_id", "subtotal", "tax", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["subtotal", 4500.0], ["tax", 405.0], ["total", 4905.0], ["created_at", 2016-12-02 03:56:52 UTC], ["updated_at", 2016-12-02 03:56:52 UTC]]
UPDATE "carted_products" SET "status" = 'purchased', "order_id" = NULL WHERE "carted_products"."user_id" = $1 AND "carted_products"."status" = $2  [["user_id", 3], ["status", "carted"]]

  def show
    @order = Order.find_by(id: params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]