app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def home
    @products = Product.all

SELECT  "categories".* FROM "categories" WHERE "categories"."category_name" = $1 LIMIT $2  [["category_name", "bikes"], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1  [["category_id", 1]]
SELECT "products".* FROM "products" ORDER BY "products"."price" DESC
SELECT "products".* FROM "products" ORDER BY "products"."product_name" DESC
---
  def index

    if params[:category_name]
      category = Category.find_by(category_name: params[:category_name])
      @products = category.products
    else
      @products = Product.all
    end


    sort_order = params[:sort]
    if sort_order == "price_high"
      @products = @products.order(price: :desc)
    elsif sort_order == "price_low"
      @products = @products.order(price: :asc)
    elsif sort_order == "name_low"
      @products = @products.order(product_name: :asc)

SELECT  "products".* FROM "products" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    rando = params[:id]
    if rando == "random"
      @product = Product.order("RANDOM()").first
    else
      @product = Product.find_by(id: params[:id])

INSERT INTO "products" ("product_name", "description", "price", "created_at", "updated_at", "supplier_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_name", "2012 VW GTI"], ["description", "Euro Hot Hatch"], ["price", 0], ["created_at", 2019-01-12 21:29:46 UTC], ["updated_at", 2019-01-12 21:29:46 UTC], ["supplier_id", 1]]
INSERT INTO "images" ("image_1", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def save_product
    @product = Product.new({product_name: params[:product_name], description: params[:description], price: params[:price], supplier_id: 1})
    if @product.save
      @image = Image.new({image_1: params[:image], product_id: @product.id})
      @image.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @products = Product.find_by(id: params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "price" = $1, "user_id" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["price", 1205], ["user_id", 3], ["updated_at", 2016-12-01 00:01:32 UTC], ["id", 14]]
---
  def update
    product = Product.find_by(id: params[:id])
    product.assign_attributes({
      product_name: params[:product_name],
      description: params[:description],
      image: params[:image],
      price: params[:price],
      # supplier_id: params[:supplier_id],
      })
    product.save

SELECT "products".* FROM "products" WHERE (product_name ILIKE '%%')
---
  def search
    @search_term = params[:search_term]

    @products = Product.where("product_name ILIKE ?", "%#{@search_term}%")

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 7]]
---
  def destroy
    product = Product.find_by(id: params[:id])
    product.destroy